# Find Replace
-  Find text in DF and replace with certain values
-  find
-  contains :  Series.str.contains(pat, case=True, flags=0, na=None, regex=True)[source]
-  match  : Series.str.match(pat, case=True, flags=0, na=None)
-  fullmatch : Series.str.fullmatch(pat, case=True, flags=0, na=None)
-  extract : Series.str.extract(pat, flags=0, expand=True)
-  extractall : Series.str.extractall(pat, flags=0)

-  https://pandas.pydata.org/docs/reference/api/pandas.Series.str.capitalize.html

In [55]:
#libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from pydataset import data
import plotnine

In [64]:
df = data('mtcars')
df.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [65]:
df.rename(columns=str.upper, index=str.title).head()

,MPG,CYL,DISP,HP,DRAT,WT,QSEC,VS,AM,GEAR,CARB
Mazda Rx4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda Rx4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [70]:
#df.reset_index(inplace=True)
df1 = df.reset_index().rename(columns={'index':'carname'})
df1.head()

,carname,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [71]:
df1.carname.str

### find

In [72]:
df1.carname.str.find('Maz')
#If the substring doesnâ€™t exist in the text, -1 is returned

0     0
1     0
2    -1
3    -1
4    -1
5    -1
6    -1
7    -1
8    -1
9    -1
10   -1
11   -1
12   -1
13   -1
14   -1
15   -1
16   -1
17   -1
18   -1
19   -1
20   -1
21   -1
22   -1
23   -1
24   -1
25   -1
26   -1
27   -1
28   -1
29   -1
30   -1
31   -1
Name: carname, dtype: int64

In [109]:
df1.carname.str.find(sub='Maz', start=10).head()  #start search after 10 rows

0   -1
1   -1
2   -1
3   -1
4   -1
Name: carname, dtype: int64

In [111]:
df1.carname.str.findall(pat = 'Maz|Dat').head()

0    [Maz]
1    [Maz]
2    [Dat]
3       []
4       []
Name: carname, dtype: object

In [113]:
import re
df1.carname.str.findall(pat = 'maz|dat').head()

0    []
1    []
2    []
3    []
4    []
Name: carname, dtype: object

In [114]:
df1.carname.str.findall(pat = 'maz|dat', flags=re.IGNORECASE).head()

0    [Maz]
1    [Maz]
2    [Dat]
3       []
4       []
Name: carname, dtype: object

In [123]:
', '.join(df1.carname.tolist())

'Mazda RX4, Mazda RX4 Wag, Datsun 710, Hornet 4 Drive, Hornet Sportabout, Valiant, Duster 360, Merc 240D, Merc 230, Merc 280, Merc 280C, Merc 450SE, Merc 450SL, Merc 450SLC, Cadillac Fleetwood, Lincoln Continental, Chrysler Imperial, Fiat 128, Honda Civic, Toyota Corolla, Toyota Corona, Dodge Challenger, AMC Javelin, Camaro Z28, Pontiac Firebird, Fiat X1-9, Porsche 914-2, Lotus Europa, Ford Pantera L, Ferrari Dino, Maserati Bora, Volvo 142E'

In [127]:
df1.carname.str.findall(pat = 'l').head()
#even if more than onece

0    []
1    []
2    []
3    []
4    []
Name: carname, dtype: object

In [131]:
df1.carname.str.findall(pat = 'al$').head() #ends with l

0    []
1    []
2    []
3    []
4    []
Name: carname, dtype: object

In [133]:
df1.carname.str.findall(pat = '^Ma').head() # begins with Ma

0    [Ma]
1    [Ma]
2      []
3      []
4      []
Name: carname, dtype: object

In [134]:
#full match
df1.carname.str.fullmatch(pat='Mazda', case=True)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
Name: carname, dtype: bool

In [135]:
df1.carname.str.fullmatch(pat='Mazda RX4', case=True)  #full match

0      True
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
Name: carname, dtype: bool

In [137]:
df1.carname.str.fullmatch(pat='mazda rX4', case=False)  #full match ignore case

0      True
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
Name: carname, dtype: bool

In [77]:
#contains
df1.carname.str.contains('Maz').head()

0     True
1     True
2    False
3    False
4    False
Name: carname, dtype: bool

In [78]:
df1.head()

,carname,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [81]:
df1.carname.str.endswith(pat = 'RX4').value_counts()

False    31
True      1
Name: carname, dtype: int64

In [83]:
df1.carname.str.startswith(pat = 'Maz').value_counts()

False    30
True      2
Name: carname, dtype: int64

In [85]:
df1.carname.str.swapcase().head()

0            mAZDA rx4
1        mAZDA rx4 wAG
2           dATSUN 710
3       hORNET 4 dRIVE
4    hORNET sPORTABOUT
Name: carname, dtype: object

In [87]:
df1.carname.str.title().head() #strings to title case

0            Mazda Rx4
1        Mazda Rx4 Wag
2           Datsun 710
3       Hornet 4 Drive
4    Hornet Sportabout
Name: carname, dtype: object

In [88]:
df1.carname.str.capitalize().head() #strings to capitalise case

0            Mazda rx4
1        Mazda rx4 wag
2           Datsun 710
3       Hornet 4 drive
4    Hornet sportabout
Name: carname, dtype: object

In [89]:
df1.carname.str.upper().head() #strings to capitalise case  - lower

0            MAZDA RX4
1        MAZDA RX4 WAG
2           DATSUN 710
3       HORNET 4 DRIVE
4    HORNET SPORTABOUT
Name: carname, dtype: object

In [91]:
df1.carname.str.split(pat=' ', n=4, expand=True).head() #strings to split with space 
#rsplit,

        0           1      2
0   Mazda         RX4   None
1   Mazda         RX4    Wag
2  Datsun         710   None
3  Hornet           4  Drive
4  Hornet  Sportabout   None

In [94]:
df1.carname.str.join(sep=', ').head() #strings split into character and join with ,

0                            M, a, z, d, a,  , R, X, 4
1                M, a, z, d, a,  , R, X, 4,  , W, a, g
2                         D, a, t, s, u, n,  , 7, 1, 0
3             H, o, r, n, e, t,  , 4,  , D, r, i, v, e
4    H, o, r, n, e, t,  , S, p, o, r, t, a, b, o, u, t
Name: carname, dtype: object

In [108]:
df1.gear.astype('category').cat.reorder_categories(new_categories=[5,3,4], ordered=True).value_counts(sort=False)
#sort by category order

5     5
3    15
4    12
Name: gear, dtype: int64